app/Controllers/AdminController.php

INSERT INTO `announcements` (`title`, `content`, `audience`, `created_at`) VALUES ('123', '123', 'student', '2025-10-17 04:34:23')
---
    public function postAnnouncement()
    {
        $announcementModel = new AnnouncementModel();

        $data = [
            'title'      => $this->request->getPost('title'),
            'content'    => $this->request->getPost('content'),
            'audience'   => $this->request->getPost('audience'), // student or teacher
            'created_at' => date('Y-m-d H:i:s')
        ];

        // Validate audience
        $validAudiences = ['student', 'teacher'];
        if (!in_array($data['audience'], $validAudiences)) {
            return redirect()->back()->with('error', 'Invalid audience selected.');
        }

        if ($announcementModel->insert($data)) {