app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@example.com'
 LIMIT 1
---
    public function login()
    {
        helper(['form']);

        if ($this->request->getMethod() === 'POST') {
            $session   = session();
            $userModel = new UserModel();

            $rules = [
                'email'    => 'required|valid_email',
                'password' => 'required|min_length[6]'
            ];

            if (!$this->validate($rules)) {
                return view('auth/login', ['validation' => $this->validator]);
            }

            $user = $userModel->where('email', $this->request->getVar('email'))->first();

SELECT *
FROM `announcements`
ORDER BY `created_at` DESC
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT *
FROM `users`
ORDER BY `id` DESC
 LIMIT 5
SELECT *
FROM `users`
WHERE `role` = 'student'
SELECT *
FROM `users`
WHERE `users`.`id` = 1
---
    public function dashboard()
    {
        $session = session();

        if (! $session->get('isLoggedIn')) {
            return redirect()->to(base_url('login'))->with('login_error', 'Please log in first.');
        }

        $role = strtolower((string) $session->get('role'));
        $userModel = new UserModel();
        $announcementModel = new AnnouncementModel();
        $data = [];

        // Fetch announcements ordered by newest first
        $announcements = $announcementModel->orderBy('created_at', 'DESC')->findAll();

        switch ($role) {
            case 'admin':
                $data['usersCount']   = $userModel->countAllResults();
                $data['recentUsers']  = $userModel->orderBy('id', 'DESC')->limit(5)->findAll();
                break;

            case 'teacher':
                $data['students']     = $userModel->where('role', 'student')->findAll();
                break;

            case 'student':
            default:
                $data['profile']      = $userModel->find((int) $session->get('userID'));